"Quits Sequential" = "Stäng ner Sequential";
"Toggles full screen" = "Byt till Fullskärmsläge";
"The page to the right" = "Sidan till höger";
"The page to the left" = "Sidan till vänster";
"The next page" = "Nästa sida";
"The end of the image" = "Slutet av bilden";
"The beginning of the image" = "Början av bilden";
"The top edge of the end side" = "Översta kanten av sidans slut";
"Primary mouse clicks move to:" = "Primärklick flyttar till:";
"When going backward, start at:" = "Vid förflyttning bakåt, börja vid:";
"Hold Control to preserve the current position." = "Håll Control nedtryckt för att bevara bildens position.";
"Images:" = "Bilder:";
"Antialias when upscaling" = "Antialiasing vid uppskalning";
"Escape key:" = "Escape tangenten:";
"Full screen:" = "Fullskärmsläge:";
"Background:" = "Backgrund:";
"Checkerboard" = "Chackbräde";
"Dim other screens" = "Tona ner andra skärmar";
"Check automatically" = "Kolla automatiskt";
"Software update:" = "Mjukvaru uppdateringar:";
"When an update is available, you can install it by choosing Install Update… from the Sequential menu." = "När en uppdatering finns tillgänglig, kan du installera denna via Installera Uppdatering… från Sequentials meny.";
"Upscale only" = "Bara Uppskalning";
"Scale freely" = "Skala fritt";
"Downscale only" = "Bara Nedskalning";
"Thumbnail image:" = "Thumbnail image:";
"Show file name" = "Show file name";
"Thumbnail container:" = "Thumbnail container:";
"Show counts and sizes" = "Show counts and sizes";
